ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78InstrInfo.cpp
//===-- RL78InstrInfo.cpp - RL78 Instruction Information ----------------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file contains the RL78 implementation of the TargetInstrInfo class.
//
//===----------------------------------------------------------------------===//

#include "RL78Subtarget.h"
#include "llvm/CodeGen/MachineFrameInfo.h"
#include "llvm/CodeGen/ScheduleDAG.h"
#include "llvm/CodeGen/ScheduleHazardRecognizer.h"
#include "llvm/MC/MCInstrInfo.h"

using namespace llvm;

#define GET_INSTRINFO_CTOR_DTOR
#include "RL78GenInstrInfo.inc"

// Pin the vtable to this file.
void RL78InstrInfo::anchor() {}

RL78InstrInfo::RL78InstrInfo(RL78Subtarget &ST)
    : RL78GenInstrInfo(RL78::ADJCALLSTACKDOWN, RL78::ADJCALLSTACKUP), RI(),
      Subtarget(ST) {}

/// isLoadFromStackSlot - If the specified machine instruction is a direct
/// load from a stack slot, return the virtual or physical register number of
/// the destination along with the FrameIndex of the loaded stack slot.  If
/// not, return 0.  This predicate must return 0 if the instruction has
/// any side effects other than loading from the stack slot.
unsigned RL78InstrInfo::isLoadFromStackSlot(const MachineInstr &MI,
                                            int &FrameIndex) const {
  // MI.dump();
  if ((MI.getOpcode() == RL78::LOAD8_r_stack_slot) ||
      (MI.getOpcode() == RL78::LOAD16_rp_stack_slot)) {
    if (MI.getOperand(1).isFI() && MI.getOperand(2).isImm() &&
        MI.getOperand(2).getImm() == 0) {
      FrameIndex = MI.getOperand(1).getIndex();
      return MI.getOperand(0).getReg();
    }
  }
  return 0;
}

/// isStoreToStackSlot - If the specified machine instruction is a direct
/// store to a stack slot, return the virtual or physical register number of
/// the source reg along with the FrameIndex of the loaded stack slot.  If
/// not, return 0.  This predicate must return 0 if the instruction has
/// any side effects other than storing to the stack slot.
unsigned RL78InstrInfo::isStoreToStackSlot(const MachineInstr &MI,
                                           int &FrameIndex) const {
  if ((MI.getOpcode() == RL78::STORE8_stack_slot_r) ||
      (MI.getOpcode() == RL78::STORE16_stack_slot_rp)) {
    if (MI.getOperand(0).isFI() && MI.getOperand(1).isImm() &&
        MI.getOperand(1).getImm() == 0) {
      FrameIndex = MI.getOperand(0).getIndex();
      return MI.getOperand(2).getReg();
    }
  }
  return 0;
}

void RL78InstrInfo::storeRegToStackSlot(MachineBasicBlock &MBB,
                                        MachineBasicBlock::iterator I,
                                        Register SrcReg, bool isKill, int FI,
                                        const TargetRegisterClass *RC,
                                        const TargetRegisterInfo *TRI) const {
  DebugLoc DL;
  // dbgs() << "storeRegToStackSlot\n";
  if (I != MBB.end())
    DL = I->getDebugLoc();
  if ((TRI->getRegSizeInBits(*RC) == 8)) {
    BuildMI(MBB, I, DL, get(RL78::STORE8_stack_slot_r))
        .addFrameIndex(FI)
        .addImm(0)
        .addReg(SrcReg, getKillRegState(isKill));
  } else {
    BuildMI(MBB, I, DL, get(RL78::STORE16_stack_slot_rp))
        .addFrameIndex(FI)
        .addImm(0)
        .addReg(SrcReg, getKillRegState(isKill));
  }
  // MBB.dump();
}

void RL78InstrInfo::loadRegFromStackSlot(MachineBasicBlock &MBB,
                                         MachineBasicBlock::iterator I,
                                         Register DestReg, int FI,
                                         const TargetRegisterClass *RC,
                                         const TargetRegisterInfo *TRI) const {
  DebugLoc DL;
  if (I != MBB.end())
    DL = I->getDebugLoc();
  // dbgs() << "loadRegFromStackSlot\n";
  if (TRI->getRegSizeInBits(*RC) == 8) {
    BuildMI(MBB, I, DL, get(RL78::LOAD8_r_stack_slot), DestReg)
        .addFrameIndex(FI)
        .addImm(0);
  } else {
    BuildMI(MBB, I, DL, get(RL78::LOAD16_rp_stack_slot), DestReg)
        .addFrameIndex(FI)
        .addImm(0);
    // We can't do this here becuase it's done during reg alloc.
    // BuildMI(MBB, I, DL, get(RL78::LOAD16_rp_stack_slot),
    // RL78::RP0).addFrameIndex(FI).addImm(0); BuildMI(MBB, I, DL,
    // get(RL78::COPY)).addReg(DestReg).addReg(RL78::RP0, RegState::Kill);
  }
  // MBB.dump();
}

static void BuildUnrolledShiftStep(const RL78InstrInfo *II,
                            llvm::MachineBasicBlock *BB, llvm::MachineInstr &MI,
                            llvm::DebugLoc &DL, unsigned int opcode,
                            const llvm::Register &Rd,
                            unsigned CounterShiftAmount, unsigned RdOpAmount,
                            unsigned OpSize, unsigned OpInstrCount,
                            MachineInstrBuilder &FirstInstruction,
                            MachineInstrBuilder &LastInstruction) {

  unsigned JumpSize = OpSize * RdOpAmount;
  if (RdOpAmount == 1) {
    FirstInstruction = BuildMI(*BB, MI, DL, II->get(RL78::CMP0_r))
                           .addReg(RL78::R3, RegState::Kill);
    if (OpInstrCount > 1)
      BuildMI(*BB, MI, DL, II->get(RL78::B_cc))
          .addImm(JumpSize)
          .addImm(RL78CC::RL78CC_Z);
    else
      BuildMI(*BB, MI, DL, II->get(RL78::SK_cc_nodst)).addImm(RL78CC::RL78CC_Z);
  } else {
    FirstInstruction = BuildMI(*BB, MI, DL, II->get(RL78::SHL_r_imm), RL78::R3)
                           .addReg(RL78::R3, RegState::Kill)
                           .addImm(CounterShiftAmount);
    if (OpInstrCount > 1 || JumpSize > 0)
      BuildMI(*BB, MI, DL, II->get(RL78::B_cc))
          .addImm(JumpSize)
          .addImm(RL78CC::RL78CC_NC);
    else
      BuildMI(*BB, MI, DL, II->get(RL78::SK_cc_nodst))
          .addImm(RL78CC::RL78CC_NC);
  }

  switch (opcode) {
  case RL78::ROTL16_rp_rp:
    for (int i = 0; i < RdOpAmount; i++) {
      BuildMI(*BB, MI, DL, II->get(RL78::MOV1_cy_r)).addReg(RL78::R1).addImm(7);
      LastInstruction =
          BuildMI(*BB, MI, DL, II->get(RL78::ROLWC_rp_1), RL78::RP0)
              .addReg(RL78::RP0, RegState::Kill);
    }
    break;

  case RL78::ROTR16_rp_rp:
    for (int i = 0; i < RdOpAmount; i++) {
      BuildMI(*BB, MI, DL, II->get(RL78::SHRW_rp_i), RL78::RP0)
          .addReg(RL78::RP0, RegState::Kill)
          .addImm(1);
      LastInstruction = BuildMI(*BB, MI, DL, II->get(RL78::MOV1_r_cy), RL78::R1)
                            .addReg(RL78::R1)
                            .addImm(7);
    }
    break;
  case RL78::ROR_r_1:
  case RL78::ROL_r_1:
    for (int i = 0; i < RdOpAmount; i++) {
      LastInstruction =
          BuildMI(*BB, MI, DL, II->get(opcode), Rd).addReg(Rd, RegState::Kill);
    }
    break;

  case RL78::SHLW_rp_imm:
    if (RdOpAmount == 1)
      LastInstruction = BuildMI(*BB, MI, DL, II->get(RL78::ADDW_rp_rp), Rd)
                            .addReg(Rd)
                            .addReg(Rd, RegState::Kill);
    else
      LastInstruction = BuildMI(*BB, MI, DL, II->get(opcode), Rd)
                            .addReg(Rd, RegState::Kill)
                            .addImm(RdOpAmount);
    break;
  default:
    LastInstruction = BuildMI(*BB, MI, DL, II->get(opcode), Rd)
                          .addReg(Rd, RegState::Kill)
                          .addImm(RdOpAmount);
    break;
  }
}

static bool BuildADDE_SUBBE_rp_rp(const RL78InstrInfo *II,
                                  llvm::MachineBasicBlock *BB,
                                  llvm::MachineInstr &MI, llvm::DebugLoc &DL,
                                  unsigned int carryOpcode,
                                  unsigned int opcode) {
  MachineInstrBuilder FirstInstruction, LastInstruction;

  if (!MI.getOperand(0).isReg() || MI.getOperand(0).getReg() != RL78::RP0 ||
      !MI.getOperand(1).isReg() ||
      MI.getOperand(0).getReg() != MI.getOperand(1).getReg() ||
      !MI.getOperand(2).isReg())
    return false;

  FirstInstruction = BuildMI(*BB, MI, DL, II->get(RL78::SK_cc_nodst))
                         .addImm(RL78CC::RL78CC_NC);
  BuildMI(*BB, MI, DL, II->get(carryOpcode), RL78::RP0)
      .addReg(RL78::RP0, RegState::Kill);

  LastInstruction = BuildMI(*BB, MI, DL, II->get(opcode), RL78::RP0)
                        .addReg(RL78::RP0, RegState::Kill)
                        .add(MI.getOperand(2));
  finalizeBundle(*BB, FirstInstruction->getIterator(),
                 std::next(LastInstruction->getIterator()));
  MI.eraseFromParent();
  return true;
}

static bool Build_MUL16_rp_rp_S2(const RL78InstrInfo *II,
                                 llvm::MachineBasicBlock *BB,
                                 llvm::MachineInstr &MI, llvm::DebugLoc &DL) {
#define MDUC 0x00E8
#define MDAL 0xFFFF0
#define MDAH 0xFFFF2
#define MDBL 0xFFFF6
  //  push  psw
  //  di
  //  clrb  !%lo16(MDUC)
  //  movw  MDAL, ax
  //  movw  ax, bc
  //  movw  MDAH, ax
  //  nop
  //  movw  ax, MDBL
  //  pop  psw ;
  //  MDUC -> F00E8, MDAL -> FFFF0, MDAH -> FFFF2, MDBL -> FFFF6
    MachineInstrBuilder FirstInstruction, LastInstruction;

