ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78InstrInfo.cpp
  // PSW register contents are saved to the stack.
  FirstInstruction = BuildMI(*BB, MI, DL, II->get(RL78::PUSH_cc));

  // Maskable interrupt acknowledgment by vectored interrupt is disabled (with
  // the interrupt enable flag (IE) cleared (0)).
  BuildMI(*BB, MI, DL, II->get(RL78::DI));

  // 0 is transferred to the MDUC address.
  BuildMI(*BB, MI, DL, II->get(RL78::CLRB_abs16)).addImm(MDUC);

  // AX register contents is transferred to the MDAL address.
  BuildMI(*BB, MI, DL, II->get(RL78::STORE16_sfrp_rp))
      .addImm(MDAL)
      .addReg(RL78::RP0, RegState::Kill);

  // Op2 register contents is transferred to the AX register.
  if (MI.getOperand(2).getReg() != RL78::RP0)
    BuildMI(*BB, MI, DL, II->get(RL78::MOVW_AX_rp), RL78::RP0)
        .addReg(MI.getOperand(2).getReg(), RegState::Kill);

  // AX register contents is transferred to the MDAH address.
  BuildMI(*BB, MI, DL, II->get(RL78::STORE16_sfrp_rp))
      .addImm(MDAH)
      .addReg(RL78::RP0, RegState::Kill);

  // Only the time is consumed without processing.
  BuildMI(*BB, MI, DL, II->get(RL78::NOP));

  // MDBL address contents is transferred to the AX register.
  BuildMI(*BB, MI, DL, II->get(RL78::LOAD16_rp_sfrp), RL78::RP0).addImm(MDBL);

  // Each flag is replaced with stack data.
  LastInstruction = BuildMI(*BB, MI, DL, II->get(RL78::POP_cc));

  finalizeBundle(*BB, FirstInstruction->getIterator(),
                 std::next(LastInstruction->getIterator()));
  MI.eraseFromParent();

  return true;
}

bool RL78InstrInfo::expandPostRAPseudo(MachineInstr &MI) const {
  MachineBasicBlock *BB = MI.getParent();
  DebugLoc DL = BB->findDebugLoc(MI);
  //      shl b, 0x05
  //      sknc
  //      Op ax, 0x08
  //      shl b, 0x01
  //      sknc
  //      Op ax, 0x04
  //      shl b, 0x01
  //      sknc
  //      Op ax, 0x02
  //      cmp0 b
  //      skz
  //      Op ax, 0x01 or optimized variant
  bool Is8Bit = false;
  unsigned opcode;
  unsigned OpSize = 0;
  unsigned OpInstrCount = 1;
  switch (MI.getOpcode()) {
  case RL78::SHLW_rp_rp:
    opcode = RL78::SHLW_rp_imm;
    break;
  case RL78::SHRW_rp_rp:
    opcode = RL78::SHRW_rp_i;
    break;
  case RL78::SARW_rp_rp:
    opcode = RL78::SARW_rp_i;
    break;
  case RL78::SHL_r_r:
    Is8Bit = true;
    opcode = RL78::SHL_r_imm;
    break;
  case RL78::SHR_r_r:
    Is8Bit = true;
    opcode = RL78::SHR_r_i;
    break;
  case RL78::SAR_r_r:
    Is8Bit = true;
    opcode = RL78::SAR_r_i;
    break;
  case RL78::ROTL16_rp_rp:
    opcode = RL78::ROTL16_rp_rp;
    // 2 (MOV1_cy_r) + 2 (ROLWC_rp_1)
    OpInstrCount = 2;
    OpSize = 4;
    break;
  case RL78::ROTR16_rp_rp:
    opcode = RL78::ROTR16_rp_rp;
    // 2 (SHRW_rp_i) + 2 (SHRW_rp_i)
    OpInstrCount = 2;
    OpSize = 4;
    break;
  case RL78::ROTL_rp_rp:
    Is8Bit = true;
    opcode = RL78::ROL_r_1;
    OpSize = 2;
    break;
  case RL78::ROTR_rp_rp:
    Is8Bit = true;
    opcode = RL78::ROR_r_1;
    OpSize = 2;
    break;
  case RL78::ADDE_rp_rp:
      return BuildADDE_SUBBE_rp_rp(this, BB, MI, DL, RL78::INCW_rp, RL78::ADDW_rp_rp);
  case RL78::SUBE_rp_rp:
      return BuildADDE_SUBBE_rp_rp(this, BB, MI, DL, RL78::DECW_rp, RL78::SUBW_rp_rp);
  case RL78::MUL16_rp_rp_S1_S2:
      return Build_MUL16_rp_rp_S2(this, BB, MI, DL);
  default:
    return false;
    break;
  }

  Register Rd;
  MachineInstrBuilder FirstInstruction, LastInstruction, IgnoredInstruction;
  assert((MI.getOperand(2).isReg() && MI.getOperand(2).getReg() == RL78::R3) &&
         "Op2 != B");
  if (Is8Bit) {
    assert(
        (MI.getOperand(0).isReg() && MI.getOperand(0).getReg() == RL78::R1) &&
        "Op0 != A");
    Rd = RL78::R1;
    BuildUnrolledShiftStep(this, BB, MI, DL, opcode, Rd, 6, 4, OpSize,
                           OpInstrCount, FirstInstruction, IgnoredInstruction);
  } else {
    assert(
        (MI.getOperand(0).isReg() && MI.getOperand(0).getReg() == RL78::RP0) &&
        "Op0 != AX");

    Rd = RL78::RP0;
    BuildUnrolledShiftStep(this, BB, MI, DL, opcode, Rd, 5, 8, OpSize,
                           OpInstrCount, FirstInstruction, IgnoredInstruction);
    BuildUnrolledShiftStep(this, BB, MI, DL, opcode, Rd, 1, 4, OpSize,
                           OpInstrCount, IgnoredInstruction,
                           IgnoredInstruction);
  }
  BuildUnrolledShiftStep(this, BB, MI, DL, opcode, Rd, 1, 2, OpSize,
                         OpInstrCount, IgnoredInstruction, IgnoredInstruction);
  BuildUnrolledShiftStep(this, BB, MI, DL, opcode, Rd, 1, 1, OpSize,
                         OpInstrCount, IgnoredInstruction, LastInstruction);

  finalizeBundle(*BB, FirstInstruction->getIterator(),
                 std::next(LastInstruction->getIterator()));
  MI.eraseFromParent();
  return true;
}

static RL78CC::CondCodes GetOppositeBranchCondition(RL78CC::CondCodes CC) {
  switch (CC) {
  case RL78CC::RL78CC_C:
    return RL78CC::RL78CC_NC;
  case RL78CC::RL78CC_NC:
    return RL78CC::RL78CC_C;
  case RL78CC::RL78CC_Z:
    return RL78CC::RL78CC_NZ;
  case RL78CC::RL78CC_NZ:
    return RL78CC::RL78CC_Z;
  case RL78CC::RL78CC_H:
    return RL78CC::RL78CC_NH;
  case RL78CC::RL78CC_NH:
    return RL78CC::RL78CC_H;
  }
  llvm_unreachable("Invalid condition code!");
}

static bool isUncondBranchOpcode(int Opc) { return Opc == RL78::BR; }

static bool isCondBranchOpcode(int Opc) {
  return (Opc == RL78::BRCC) || (Opc == RL78::BTBF) || (Opc == RL78::BTBF_mem) || (Opc == RL78::BTBF_sfr);
}

static bool isIndirectBranchOpcode(int Opc) { return Opc == RL78::BR_AX; }

static void parseCondBranch(MachineInstr *LastInst, MachineBasicBlock *&Target,
                            SmallVectorImpl<MachineOperand> &Cond) {
  Cond.push_back(MachineOperand::CreateImm(LastInst->getOperand(1).getImm()));
  Target = LastInst->getOperand(0).getMBB();
  // if BT/BF/BTCLR instruction add the remaining 2 operands (reg and bit)
  // LastInst->dump();
  if (LastInst->getNumOperands() > 3) {
    Cond.push_back(MachineOperand::CreateImm(LastInst->getOpcode()));
    Cond.push_back(LastInst->getOperand(2));
    Cond.push_back(LastInst->getOperand(3));
  }
}

bool RL78InstrInfo::analyzeBranch(MachineBasicBlock &MBB,
                                  MachineBasicBlock *&TBB,
                                  MachineBasicBlock *&FBB,
                                  SmallVectorImpl<MachineOperand> &Cond,
                                  bool AllowModify) const {
  MachineBasicBlock::iterator I = MBB.getLastNonDebugInstr();
  // empty BB? fall-through
  if (I == MBB.end())
    return false;

  // not a branch instruction? fall-through
  if (!isUnpredicatedTerminator(*I))
    return false;

  // Get the last instruction in the block.
  MachineInstr *LastInst = &*I;
  unsigned LastOpc = LastInst->getOpcode();

  // If there is only one terminator instruction, process it.
  if (I == MBB.begin() || (!(--I)->isBranch())) {
    if (isUncondBranchOpcode(LastOpc)) {
      TBB = LastInst->getOperand(0).getMBB();
      return false;
    }
    if (isCondBranchOpcode(LastOpc)) {
      // Block ends with fall-through condbranch.
      parseCondBranch(LastInst, TBB, Cond);
      return false;
    }
    return true; // Can't handle indirect branch.
  }
  // MBB.dump();
  // Get the instruction before it if it is a terminator.
  MachineInstr *SecondLastInst = &*I;
  unsigned SecondLastOpc = SecondLastInst->getOpcode();

  // If AllowModify is true and the block ends with two or more unconditional
  // branches, delete all but the first unconditional branch.
  if (AllowModify && isUncondBranchOpcode(LastOpc)) {
    while (isUncondBranchOpcode(SecondLastOpc)) {
      LastInst->eraseFromParent();
      LastInst = SecondLastInst;
      LastOpc = LastInst->getOpcode();
      if (I == MBB.begin() || (!(--I)->isBranch())) {
        // Return now the only terminator is an unconditional branch.
        TBB = LastInst->getOperand(0).getMBB();
        return false;
      } else {
        SecondLastInst = &*I;
        SecondLastOpc = SecondLastInst->getOpcode();
      }
    }
  }

