ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78InstrInfo.cpp
    BuildMI(MBB, I, DL, get(RL78::MOV1_cy_r))
        .addReg(SrcReg, getKillRegState(KillSrc))
        .addImm(0);
  }
  // 8 bit reg to CS
  else if (RL78::CS == DestReg && RL78::RL78Bank0RegRegClass.contains(SrcReg)) {
    if (RL78::R1 == SrcReg) {
      BuildMI(MBB, I, DL, get(RL78::MOV_cs_A), RL78::CS)
          .addReg(RL78::R1, RegState::Kill);
    } else {
      BuildMI(MBB, I, DL, get(RL78::XCH_A_r), RL78::R1)
          .addReg(SrcReg, RegState::Define)
          .addReg(RL78::R1, RegState::Kill)
          .addReg(SrcReg, RegState::Kill);
      BuildMI(MBB, I, DL, get(RL78::MOV_cs_A), RL78::CS)
          .addReg(RL78::R1, RegState::Kill);
      BuildMI(MBB, I, DL, get(RL78::XCH_A_r), RL78::R1)
          .addReg(SrcReg, RegState::Define)
          .addReg(RL78::R1, RegState::Kill)
          .addReg(SrcReg, RegState::Kill);
    }
  } 
  else if (SrcReg == RL78::MACRH || SrcReg == RL78::MACRL) {
    unsigned SrcAddr = SrcReg == RL78::MACRH ? MACRHigh : MACRLow;
    if (DestReg == RL78::RP0)
        BuildMI(MBB, I, DL, get(RL78::LOAD16_rp_abs16), RL78::RP0)
            .addImm(SrcAddr);
    else {
      BuildMI(MBB, I, DL, get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(DestReg, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(DestReg, RegState::Kill);
      BuildMI(MBB, I, DL, get(RL78::LOAD16_rp_abs16), RL78::RP0)
            .addImm(SrcAddr);
      BuildMI(MBB, I, DL, get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(DestReg, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(DestReg, RegState::Kill);
    }
  } 
  else if (DestReg == RL78::MACRH || DestReg == RL78::MACRL) {
      unsigned DestAddr = DestReg == RL78::MACRH ? MACRHigh : MACRLow;
    if (SrcReg == RL78::RP0)
        BuildMI(MBB, I, DL, get(RL78::STORE16_abs16_rp))
            .addImm(DestAddr)
            .addReg(RL78::RP0, getKillRegState(KillSrc));
    else {
      BuildMI(MBB, I, DL, get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(SrcReg, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(SrcReg, RegState::Kill);
      BuildMI(MBB, I, DL, get(RL78::STORE16_abs16_rp))
            .addImm(DestAddr)
            .addReg(RL78::RP0);
      BuildMI(MBB, I, DL, get(RL78::XCHW_AX_rp), RL78::RP0)
          .addReg(SrcReg, RegState::Define)
          .addReg(RL78::RP0, RegState::Kill)
          .addReg(SrcReg, RegState::Kill);
    }
  }  
  else
    llvm_unreachable("Unknown copy!");
  // MovMI->addRegisterDefined(DestReg, TRI);
}

unsigned RL78InstrInfo::getInstSizeInBytes(const MachineInstr &MI) const {

  if (MI.isInlineAsm())
    return 128;

  switch (MI.getOpcode()) {
    // Worst case scenario for BRCC is SK_cc + BR_rel16 =
    // 2 + 3 = 5. And for BT/BF is MOV1 + 5 = 8.
  case RL78::BRCC:
    return 5;
  case RL78::BTBF:
  case RL78::BTBF_mem:
    return 8;
  case RL78::BR:
    return 4;
  case TargetOpcode::BUNDLE: {
    unsigned Size = 0;
    MachineBasicBlock::const_instr_iterator I = MI.getIterator();
    MachineBasicBlock::const_instr_iterator E = MI.getParent()->instr_end();
    while (++I != E && I->isInsideBundle()) {
      assert(!I->isBundle() && "No nested bundle!");
      Size += getInstSizeInBytes(*I);
    }
    return Size;
  }
  default:
  return MI.getDesc().getSize();
  }
}

/// Constants defining how certain sequences should be outlined.
///
/// \p MachineOutlinerDefault implies that the function is called with a call
/// instruction, and a return must be emitted for the outlined function frame.
///
/// That is,
///
/// I1                                 OUTLINED_FUNCTION:
/// I2 --> call OUTLINED_FUNCTION       I1
/// I3                                  I2
///                                     I3
///                                     ret
///
/// * Call construction overhead: 1 (call instruction)
/// * Frame construction overhead: 1 (return instruction)
///
/// \p MachineOutlinerTailCall implies that the function is being tail called.
/// A jump is emitted instead of a call, and the return is already present in
/// the outlined sequence. That is,
///
/// I1                                 OUTLINED_FUNCTION:
/// I2 --> jmp OUTLINED_FUNCTION       I1
/// ret                                I2
///                                    ret
///
/// * Call construction overhead: 1 (jump instruction)
/// * Frame construction overhead: 0 (don't need to return)
///
enum MachineOutlinerClass { MachineOutlinerDefault, MachineOutlinerTailCall };

/// Returns a \p outliner::OutlinedFunction struct containing target-specific
/// information for a set of outlining candidates.
outliner::OutlinedFunction RL78InstrInfo::getOutliningCandidateInfo(
    std::vector<outliner::Candidate> &RepeatedSequenceLocs) const {
  //
  unsigned SequenceSize =
      std::accumulate(RepeatedSequenceLocs[0].front(),
                      std::next(RepeatedSequenceLocs[0].back()), 0,
                      [this](unsigned Sum, const MachineInstr &MI) {
                        return Sum + getInstSizeInBytes(MI);
                      });

  if (RepeatedSequenceLocs[0].back()->isTerminator()) {
    unsigned CO = Subtarget.HasFarCodeModel() ? get(RL78::BR_addr20).getSize()
                                              : get(RL78::BR_addr16).getSize();

    for (outliner::Candidate &C : RepeatedSequenceLocs)
      C.setCallInfo(MachineOutlinerTailCall, CO);

    return outliner::OutlinedFunction(RepeatedSequenceLocs, SequenceSize,
                                      0, // Number of bytes to emit frame.
                                      MachineOutlinerTailCall // Type of frame.
    );
  }
  unsigned CO = Subtarget.HasFarCodeModel() ? get(RL78::CALL_addr20).getSize()
                                            : get(RL78::CALL_addr16).getSize();
  for (outliner::Candidate &C : RepeatedSequenceLocs)
    C.setCallInfo(MachineOutlinerDefault, CO);
  return outliner::OutlinedFunction(RepeatedSequenceLocs, SequenceSize, 0,
                                    MachineOutlinerDefault);
}

/// Returns how or if \p MI should be outlined.
outliner::InstrType
RL78InstrInfo::getOutliningType(MachineBasicBlock::iterator &MIT,
                                unsigned Flags) const {
  MachineInstr &MI = *MIT;
  // Don't allow debug values to impact outlining type.
  if (MI.isDebugInstr() || MI.isIndirectDebugValue())
    return outliner::InstrType::Invisible;

  // For now, disable outlining bundled instructions, since the outliner does not copy them 
  // as we expect.
  // TODO: investigate why is this happening?
  // One possible reason is the usage of the simple iterator instead of the
  // instr_iterator when creating the outlined function instructions.
  if(MI.isInsideBundle() || MI.getOpcode() == TargetOpcode::BUNDLE)
      return outliner::InstrType::Illegal;

  // At this point, KILL instructions don't really tell us much so we can go
  // ahead and skip over them.
  if (MI.isKill())
    return outliner::InstrType::Invisible;

