ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78InstrInfo.cpp
  // Is this a tail call? If yes, we can outline as a tail call.
  if (isTailCall(MI))
    return outliner::InstrType::Legal;

  // Is this the terminator of a basic block?
  if (MI.isTerminator() || MI.isReturn()) {

    // Does its parent have any successors in its MachineFunction?
    if (MI.getParent()->succ_empty())
      return outliner::InstrType::Legal;

    // It does, so we can't tail call it.
    return outliner::InstrType::Illegal;
  }
  // Positions can't safely be outlined.
  if (MI.isPosition())
    return outliner::InstrType::Illegal;
  // Make sure none of the operands of this instruction do anything tricky.
  for (const MachineOperand &MOP : MI.operands())
    if (MOP.isCPI() || MOP.isJTI() || MOP.isCFIIndex() || MOP.isFI() ||
        MOP.isTargetIndex() || (MOP.isReg() && MOP.getReg() == RL78::SPreg))
      return outliner::InstrType::Illegal;

  return outliner::InstrType::Legal;
}

/// Insert a custom frame for outlined functions.
void RL78InstrInfo::buildOutlinedFrame(
    MachineBasicBlock &MBB, MachineFunction &MF,
    const outliner::OutlinedFunction &OF) const {
  // If we're a tail call, we already have a return, so don't do anything.
  if (OF.FrameConstructionID == MachineOutlinerTailCall)
    return;

  // We're a normal call, so our sequence doesn't have a return instruction.
  // Add it in.
  MachineInstr *retq = BuildMI(MF, DebugLoc(), get(RL78::RET));
  MBB.insert(MBB.end(), retq);
}

/// Insert a call to an outlined function into the program.
/// Returns an iterator to the spot where we inserted the call. This must be
/// implemented by the target.
MachineBasicBlock::iterator RL78InstrInfo::insertOutlinedCall(
    Module &M, MachineBasicBlock &MBB, MachineBasicBlock::iterator &It,
    MachineFunction &MF, outliner::Candidate &C) const {
  // Is it a tail call?
  unsigned Opcode;
  if (C.CallConstructionID == MachineOutlinerTailCall) {
    // Yes, just insert a JMP.
    Opcode = Subtarget.HasFarCodeModel() ? RL78::BR_addr20 : RL78::BR_addr16;
  } else {
    // No, insert a call.
    Opcode =
        Subtarget.HasFarCodeModel() ? RL78::CALL_addr20 : RL78::CALL_addr16;
  }
  It = MBB.insert(It, BuildMI(MF, DebugLoc(), get(Opcode))
                          .addGlobalAddress(M.getNamedValue(MF.getName())));
  return It;
}

/// Return true if the function can safely be outlined from.
/// A function \p MF is considered safe for outlining if an outlined function
/// produced from instructions in F will produce a program which produces the
/// same output for any set of given inputs.
bool RL78InstrInfo::isFunctionSafeToOutlineFrom(
    MachineFunction &MF, bool OutlineFromLinkOnceODRs) const {
  const Function &F = MF.getFunction();
  // If we *don't* want to outline from things that could potentially be deduped
  // then return false.
  if (!OutlineFromLinkOnceODRs && F.hasLinkOnceODRLinkage())
    return false;

  // It's safe to outline from MF.
  return true;
}

/// Return true if the function should be outlined from by default.
bool RL78InstrInfo::shouldOutlineFromFunctionByDefault(
    MachineFunction &MF) const {
  return MF.getFunction().hasOptSize();
}

ArrayRef<std::pair<unsigned, const char *>>
RL78InstrInfo::getSerializableDirectMachineOperandTargetFlags() const {

  static const std::pair<unsigned, const char *> Flags[] = {
      {SPII::MO_LOW8, "rl78_low8"},
      {SPII::MO_LOW16, "rl78_low16"},
      {SPII::MO_HI16, "rl78_hi16"}};
  return makeArrayRef(Flags);
}

MachineInstr *RL78InstrInfo::foldMemoryOperandImpl(
    MachineFunction &MF, MachineInstr &MI, ArrayRef<unsigned> Ops,
    MachineBasicBlock::iterator InsertPt, int FrameIndex, LiveIntervals *LIS,
    VirtRegMap *VRM) const {
  if ((MI.getOpcode() != RL78::MOV_r_imm) && (MI.getOpcode() != RL78::ONEB_r) &&
      (MI.getOpcode() != RL78::CLRB_r))
    return nullptr;

  //In cases like: undef %39.sub_hi:rl78rpregs = MOV_r_imm 0
  //we need to do a +1 to get the correst stack address.
  assert(MI.getOperand(0).isReg());
  unsigned subReg = (MI.getOperand(0).getSubReg() == RL78::sub_hi)? 1 : 0;

  int64_t Imm;
  switch (MI.getOpcode()) {
  case RL78::MOV_r_imm:
    Imm = MI.getOperand(1).getImm();
    break;
  case RL78::ONEB_r:
    Imm = 1;
    break;
  case RL78::CLRB_r:
    Imm = 0;
    break;
  }
  return BuildMI(*MI.getParent(), InsertPt, MI.getDebugLoc(),
                 get(RL78::STORE8_stack_slot_imm))
      .addFrameIndex(FrameIndex)
      .addImm(subReg)
      .addImm(Imm);
}

// See 7.2.3 Hazards related to combined instructions
// in the RL78 Software Manual.
class RL78HazardRecognizer : public ScheduleHazardRecognizer {
  const unsigned SP = 8;
  const unsigned CS = 9;
  // 0-7 Bak 0 regs, 8 - SP reg, 9 - CS reg.
  BitVector RegMask;
  // Is the issued instruction an SEL instruction?
  bool SelI;
  // Is an instruction issues in this cycle?
  bool Issue;

public:
  RL78HazardRecognizer() : RegMask(10){};

  /// atIssueLimit - Return true if no more instructions may be issued in this
  /// cycle.
  ///
  /// FIXME: remove this once MachineScheduler is the only client.
  bool atIssueLimit() const override { return Issue; }

  /// Reset - This callback is invoked when a new block of
  /// instructions is about to be schedule. The hazard state should be
  /// set to an initialized state.
  void Reset() override {
    RegMask.reset();
    SelI = false;
    Issue = false;
  }

  /// EmitInstruction - This callback is invoked when an instruction is
  /// emitted, to advance the hazard state.
  void EmitInstruction(SUnit *SU) override {
    RegMask.reset();
    Issue = true;
    SelI = SU->getInstr()->getOpcode() == RL78::SEL;
    // SU->getInstr()->dump();
    for (unsigned i = 0; i < SU->getInstr()->getNumOperands(); ++i) {
      if (SU->getInstr()->getOperand(i).isReg() &&
          SU->getInstr()->getOperand(i).isDef()) {
        switch (SU->getInstr()->getOperand(i).getReg().id()) {
        case RL78::R0:
        case RL78::R1:
        case RL78::R2:
        case RL78::R3:
        case RL78::R4:
        case RL78::R5:
        case RL78::R6:
        case RL78::R7:
          RegMask.set(SU->getInstr()->getOperand(i).getReg().id() - RL78::R0);
          break;
        case RL78::RP0:
        case RL78::RP2:
        case RL78::RP4:
        case RL78::RP6:
          RegMask.set(SU->getInstr()->getOperand(i).getReg().id() - RL78::RP0);
          RegMask.set(SU->getInstr()->getOperand(i).getReg().id() - RL78::RP0 +
                      1);
          break;
        case RL78::SPreg:
          RegMask.set(SP);
          break;
        case RL78::CS:
          RegMask.set(CS);
          break;
        }
      }
    }
  }

