ksekimoto/llvm-project/llvm/lib/Target/RL78/RL78InstrInfo.cpp
  /// AdvanceCycle - This callback is invoked whenever the next top-down
  /// instruction to be scheduled cannot issue in the current cycle, either
  /// because of latency or resource conflicts.  This should increment the
  /// internal state of the hazard recognizer so that previously "Hazard"
  /// instructions will now not be hazards.
  void AdvanceCycle() override {
    RegMask.reset();
    SelI = false;
    Issue = false;
  }

  /// getHazardType - Return the hazard type of emitting this node.  There are
  /// three possible results.  Either:
  ///  * NoHazard: it is legal to issue this instruction on this cycle.
  ///  * Hazard: issuing this instruction would stall the machine.  If some
  ///     other instruction is available, issue it first.
  ///  * NoopHazard: issuing this instruction would break the program.  If
  ///     some other instruction can be issued, do so, otherwise issue a noop.
  HazardType getHazardType(SUnit *m, int Stalls = 0) {
    switch (m->getInstr()->getOpcode()) {
    case RL78::BR_AX: {
      BitVector AX(2, true);
      if (SelI || RegMask.anyCommon(AX) || RegMask.test(CS))
        return Hazard;
      return NoHazard;
    }
    case RL78::CALL_rp:
    case RL78::CALL_cs_rp:
    case RL78::CALL_rp_fp: {
      BitVector Bank0(8, true);
      if (SelI || RegMask.anyCommon(Bank0) || RegMask.test(CS) ||
          RegMask.test(SP))
        return Hazard;
      return NoHazard;
    }
    case RL78::PUSH_cc:
    case RL78::PUSH_rp:
    case RL78::POP_cc:
    case RL78::POP_rp:
    case RL78::BRK:
    case RL78::LOAD8_r_stack_slot:
    case RL78::LOAD16_rp_stack_slot:
    case RL78::STORE8_stack_slot_r:
    case RL78::STORE16_stack_slot_rp:
      if (RegMask.test(SP))
        return Hazard;
      return NoHazard;
    }
    if (m->getInstr()->isCall() || m->getInstr()->isReturn()) {
      if (RegMask.test(SP))
        return Hazard;
    }
    if (m->getInstr()->mayLoad() && (m->getInstr()->getNumOperands() >= 2) &&
        m->getInstr()->getOperand(1).isReg()) {
      switch (m->getInstr()->getOperand(1).getReg().id()) {
      case RL78::R2:
      case RL78::R3:
      case RL78::R4:
      case RL78::R5:
      case RL78::R6:
      case RL78::R7:
        if (SelI ||
            RegMask.test(m->getInstr()->getOperand(1).getReg().id() - RL78::R0))
          return Hazard;
        return NoHazard;
      case RL78::RP2:
      case RL78::RP4:
      case RL78::RP6:
        if (SelI ||
            RegMask.test(m->getInstr()->getOperand(1).getReg().id() -
                         RL78::RP0) ||
            RegMask.test(m->getInstr()->getOperand(1).getReg().id() -
                         RL78::RP0 + 1))
          return Hazard;
        return NoHazard;
      }
    }
    if (m->getInstr()->mayStore() && (m->getInstr()->getNumOperands() >= 1) &&
        m->getInstr()->getOperand(0).isReg()) {
      switch (m->getInstr()->getOperand(0).getReg().id()) {
      case RL78::R2:
      case RL78::R3:
      case RL78::R4:
      case RL78::R5:
      case RL78::R6:
      case RL78::R7:
        if (SelI ||
            RegMask.test(m->getInstr()->getOperand(0).getReg().id() - RL78::R0))
          return Hazard;
        return NoHazard;
      case RL78::RP2:
      case RL78::RP4:
      case RL78::RP6:
        if (SelI ||
            RegMask.test(m->getInstr()->getOperand(0).getReg().id() -
                         RL78::RP0) ||
            RegMask.test(m->getInstr()->getOperand(0).getReg().id() -
                         RL78::RP0 + 1))
          return Hazard;
        return NoHazard;
      }
    }
    return NoHazard;
  }

  /// ShouldPreferAnother - This callback may be invoked if getHazardType
  /// returns NoHazard. If, even though there is no hazard, it would be better
  /// to schedule another available instruction, this callback should return
  /// true.
  bool ShouldPreferAnother(SUnit *SU) override {
    for (unsigned i = 0; i < SU->getInstr()->getNumOperands(); ++i) {
      // Current Post RA scheduler is top down, If the instruction defines
      // A/AX schedule it as late as possible, this means fewer exchange
      // instructions as we can use A/AX without storing/restoring it.
      // FIXME: expand for the reverse case when A/AX is kill:
      /// schedule it first.
      if (SU->getInstr()->getOperand(i).isReg() &&
          ((SU->getInstr()->getOperand(i).getReg() == RL78::R1) ||
           (SU->getInstr()->getOperand(i).getReg() == RL78::RP0)) &&
          SU->getInstr()->getOperand(i).isDef())
        return true;
    }
    return false;
  }
};

ScheduleHazardRecognizer *RL78InstrInfo::CreateTargetPostRAHazardRecognizer(
    const InstrItineraryData *, const ScheduleDAG *DAG) const {
  return new RL78HazardRecognizer();
}